{
    "module": "keras",
    "class_name": "Sequential",
    "config": {
        "name": "sequential_318",
        "trainable": true,
        "dtype": {
            "module": "keras",
            "class_name": "DTypePolicy",
            "config": {
                "name": "float32"
            },
            "registered_name": null
        },
        "layers": [
            {
                "module": "keras.layers",
                "class_name": "InputLayer",
                "config": {
                    "batch_shape": [
                        1,
                        24,
                        1
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "name": "input_layer_318"
                },
                "registered_name": null
            },
            {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                    "name": "dense_654",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float32"
                        },
                        "registered_name": null
                    },
                    "units": 32,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        1,
                        24,
                        1
                    ]
                }
            },
            {
                "module": "keras.layers",
                "class_name": "LSTM",
                "config": {
                    "name": "lstm_640",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float32"
                        },
                        "registered_name": null
                    },
                    "return_sequences": true,
                    "return_state": false,
                    "go_backwards": false,
                    "stateful": false,
                    "unroll": false,
                    "zero_output_for_mask": false,
                    "units": 8,
                    "activation": "tanh",
                    "recurrent_activation": "sigmoid",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "recurrent_initializer": {
                        "module": "keras.initializers",
                        "class_name": "OrthogonalInitializer",
                        "config": {
                            "gain": 1.0,
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "unit_forget_bias": true,
                    "kernel_regularizer": null,
                    "recurrent_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "recurrent_constraint": null,
                    "bias_constraint": null,
                    "dropout": 0.0,
                    "recurrent_dropout": 0.0,
                    "seed": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        1,
                        24,
                        32
                    ]
                }
            },
            {
                "module": "keras.layers",
                "class_name": "LSTM",
                "config": {
                    "name": "lstm_641",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float32"
                        },
                        "registered_name": null
                    },
                    "return_sequences": false,
                    "return_state": false,
                    "go_backwards": false,
                    "stateful": false,
                    "unroll": false,
                    "zero_output_for_mask": false,
                    "units": 32,
                    "activation": "tanh",
                    "recurrent_activation": "sigmoid",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "recurrent_initializer": {
                        "module": "keras.initializers",
                        "class_name": "OrthogonalInitializer",
                        "config": {
                            "gain": 1.0,
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "unit_forget_bias": true,
                    "kernel_regularizer": null,
                    "recurrent_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "recurrent_constraint": null,
                    "bias_constraint": null,
                    "dropout": 0.0,
                    "recurrent_dropout": 0.0,
                    "seed": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        1,
                        24,
                        8
                    ]
                }
            },
            {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                    "name": "dense_655",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float32"
                        },
                        "registered_name": null
                    },
                    "units": 32,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        1,
                        32
                    ]
                }
            },
            {
                "module": "keras.layers",
                "class_name": "Dense",
                "config": {
                    "name": "dense_656",
                    "trainable": true,
                    "dtype": {
                        "module": "keras",
                        "class_name": "DTypePolicy",
                        "config": {
                            "name": "float32"
                        },
                        "registered_name": null
                    },
                    "units": 1,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "module": "keras.initializers",
                        "class_name": "GlorotUniform",
                        "config": {
                            "seed": null
                        },
                        "registered_name": null
                    },
                    "bias_initializer": {
                        "module": "keras.initializers",
                        "class_name": "Zeros",
                        "config": {},
                        "registered_name": null
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "registered_name": null,
                "build_config": {
                    "input_shape": [
                        1,
                        32
                    ]
                }
            }
        ],
        "build_input_shape": [
            1,
            24,
            1
        ]
    },
    "registered_name": null,
    "build_config": {
        "input_shape": [
            1,
            24,
            1
        ]
    },
    "compile_config": {
        "optimizer": {
            "module": "keras.optimizers",
            "class_name": "Adam",
            "config": {
                "name": "adam",
                "learning_rate": 0.0010000000474974513,
                "weight_decay": null,
                "clipnorm": null,
                "global_clipnorm": null,
                "clipvalue": null,
                "use_ema": false,
                "ema_momentum": 0.99,
                "ema_overwrite_frequency": null,
                "loss_scale_factor": null,
                "gradient_accumulation_steps": null,
                "beta_1": 0.9,
                "beta_2": 0.999,
                "epsilon": 1e-07,
                "amsgrad": false
            },
            "registered_name": null
        },
        "loss": "mean_squared_error",
        "loss_weights": null,
        "metrics": null,
        "weighted_metrics": null,
        "run_eagerly": false,
        "steps_per_execution": 1,
        "jit_compile": false
    }
}